Tekla.Structures.Geometry3d.GeometricPlane
The GeometricPlane class represents a 3d geometric plane.
using System.Collections;
using Tekla.Structures.Geometry3d;
using Tekla.Structures.Model;
using Tekla.Structures.Model.UI;
namespace CreatePlateWithGeometricPlane
{
internal class Program
{
static void Main()
{
ArrayList facePoints = new ArrayList();
ModelObject modelObject = null;
Picker picker = new Picker();
PickInput pickedInput = picker.PickFace("Pick a face to create a plate with geometric plane");
IEnumerator myEnum = pickedInput.GetEnumerator();
while (myEnum.MoveNext())
{
InputItem item = myEnum.Current as InputItem;
if (item.GetInputType() == InputItem.InputTypeEnum.INPUT_1_OBJECT)
{
modelObject = item.GetData() as ModelObject;
}
if (item.GetInputType() == InputItem.InputTypeEnum.INPUT_POLYGON)
{
facePoints = item.GetData() as ArrayList;
}
}
if(facePoints.Count < 3) return;
GeometricPlane plane = new GeometricPlane((Point)facePoints[1],
new Vector((Point)facePoints[0] - (Point)facePoints[1]),
new Vector((Point)facePoints[2] - (Point)facePoints[1]));
CreateContourPlate(facePoints, plane.GetNormal());
new Model().CommitChanges();
bool parallel = Parallel.PlaneToPlane(plane, new GeometricPlane(modelObject.GetCoordinateSystem()));
}
private static void CreateContourPlate(ArrayList contourPoints, Vector normal)
{
double distance = 100.0;
Vector translate = normal * distance;
ContourPlate plate = new ContourPlate();
plate.Profile.ProfileString = "PL10";
foreach (Point contourPoint in contourPoints)
{
plate.Contour.AddContourPoint(new ContourPoint(contourPoint + translate, null));
}
plate.Insert();
}
}
}